Revit 2024 API
FittingAndAccessoryCalculationType Enumeration
 The MEP fitting and accessory pressure drop calculation type.
 Enum of fitting and accessory pressure drop calculation type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum FittingAndAccessoryCalculationType
Visual Basic
Public Enumeration FittingAndAccessoryCalculationType
Visual C++
public enum class FittingAndAccessoryCalculationType
Members
Member name | Description
Undefined |  Undefined fitting and accessory pressure drop calculation type.
CalculatePressureDrop |  To calculate the pressure drop of the fitting and accessory.
CalculateDefaultSettings |  To calculate the default settings of the fitting and accessory.
ValidateCurrentSettings |  To validate the current settings of the fitting and accessory.
See Also
Autodesk.Revit.DB Namespace